# BuiltInFailures.FluidFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FluidFailures Class
BuiltInFailures Class Members See Also
---
Failures about Fluid.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class FluidFailures
```

Visual Basic
---
```text
Public NotInheritable Class FluidFailures
```

Visual C++
---
```text
public ref class FluidFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..FluidFailures
# See Also
BuiltInFailures..::..FluidFailures Members
Autodesk.Revit.DB Namespace